backend/app/controllers/beads_controller.rb

    def index
        beads = Bead.all
---
SELECT "beads".* FROM "beads"

    def show
        bead = Bead.find_by(id: params[:id])
---
SELECT "beads".* FROM "beads" WHERE "beads"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]