backend/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        project = Project.find_by(id: params[:id])